weixin_test/modules/m/views/layouts/main.php

SELECT * FROM `brand_setting`
---
MAsset::register($this);
use\app\models\brand\BrandSetting;
use \app\common\services\UtilService;
$brand=BrandSetting::find()->asArray()->all();