modules/m/controllers/common/BaseController.php

SELECT * FROM `member` WHERE (`id`='2') AND (`status`=1)
---
    protected function checkLoginStatus(){

        $auth_cookie = $this->getCookie( $this->auth_cookie_name );

        if( !$auth_cookie ){
            return false;
        }
        list($auth_token,$member_id) = explode("#",$auth_cookie);
        if( !$auth_token || !$member_id ){
            return false;
        }
        if( $member_id && preg_match("/^\d+$/",$member_id) ){
            $member_info = Member::findOne([ 'id' => $member_id,'status' => 1 ]);