weixin_test/modules/m/controllers/DefaultController.php

SELECT * FROM `brand_setting`
SELECT * FROM `brand_images` ORDER BY `id` DESC
---
    public function actionIndex()
    {
        $info=BrandSetting::find()->one();
        $list=BrandImages::find()->orderBy(['id'=>SORT_DESC])->all();