common/services/applog/AppLogService.php

    public function addErrorLog($appname,$content)
    {
        //yii自带获取错误的方法
       $error = \Yii::$app->errorHandler->exception;
        // 插入新客户的记录
        $model_app_logs = new AppLog();
        $model_app_logs->app_name = $appname;
        $model_app_logs->content = $content;
        $model_app_logs->ip=UtilService::getIP();

        if( !empty($_SERVER['HTTP_USER_AGENT']) ) {
            $model_app_logs ->ua = "[UA:{$_SERVER['HTTP_USER_AGENT']}]";
        }

        if ($error) {

            if(method_exists($error,'getName' )) {
                $model_app_logs->err_name = $error->getName();
            }

            if (isset($error->statusCode)) {
                $model_app_logs->http_code = $error->statusCode;
            }

            $model_app_logs->err_code = $error->getCode();
        }

        $model_app_logs->created_time = date("Y-m-d H:i:s");
        $model_app_logs->save(0);
---
INSERT INTO `app_log` (`app_name`, `content`, `ip`, `ua`, `err_name`, `http_code`, `err_code`, `created_time`) VALUES ('basic', 'Page not found. [file:D:\\website\\weixin_test\\vendor\\yiisoft\\yii2\\web\\Application.php][line:112][code:0][url:/m/product/ops][POST_DATA:act=view_count&book_id=8]', '127.0.0.1', '[UA:Mozilla/5.0 (Windows NT 6.1; WOW64; rv:52.0) Gecko/20100101 Firefox/52.0 FirePHP/0.7.4]', 'Not Found', 404, 0, '2017-11-14 17:16:12')