models/sms/SmsCaptcha.php

    public static function checkCaptcha( $mobile , $captcha )
    {
        $info = self::find()->where( [ 'mobile' => $mobile,'captcha' => $captcha ] )->one();
        if( $info &&  strtotime( $info['expires_at'] ) >= time()  ){
            $info->expires_at = date("Y-m-d H:i:s",time() - 1 );
            $info->status = 1;
            $info->save( 0 );
---
SELECT * FROM `sms_captcha` WHERE (`mobile`='15727630256') AND (`captcha`='25902')
UPDATE `sms_captcha` SET `expires_at`='2017-11-14 17:33:35', `status`=1 WHERE `id`='34'

    public function geneCustomCaptcha( $mobile,$ip = '',$sign = '',$channel = '' ){
        $this->mobile = $mobile;
        $this->ip = $ip;
        $this->captcha = rand(10000,99999);
        $this->expires_at = date("Y-m-d H:i:s",time() + 60 * 10  );
        $this->created_time = date( "Y-m-d H:i:s");
        $this->status = 0 ;
        //对接了手机验证码供应商，todo实现发验证码
//        $url="https://sapi.k780.com/?app=sms.send&tempid=51224&param=usernm%3Dusernm%26code%3D{$code}&phone={$mobile}&appkey=22516&sign=f5c57e1ba28a99e3a30b08e754ac05d1";
//       $res = HttpClient::get($url);
//       var_dump($res);
        return $this->save( 0 );
---
INSERT INTO `sms_captcha` (`mobile`, `ip`, `captcha`, `expires_at`, `created_time`, `status`) VALUES ('17601637638', '127.0.0.1', '53157', '2017-10-30 20:39:45', '2017-10-30 20:29:45', 0)