modules/m/controllers/UserController.php

SELECT * FROM `member` WHERE (`mobile`='15727630256') AND (`status`=1)
SELECT * FROM `member` WHERE `mobile`='15727630256'
---
    public function actionBind()
    {
        $this->layout = 'main';
        if (Yii::$app->request->isGet) {
            return $this->render('bind');
        }
        $mobile = trim($this->post("mobile"));
        $img_captcha = trim($this->post("img_captcha"));
        $captcha_code = trim($this->post("captcha_code"));
        $openid = $this->getCookie($this->auth_cookie_current_openid);
        $date_now = date("Y-m-d H:i:s");
        if (mb_strlen($mobile, "utf-8") < 1 || !preg_match("/^[1-9]\d{10}$/", $mobile)) {
            return $this->renderJSON([], "请输入符合要求的手机号码~~", -1);
        }

        if (mb_strlen($img_captcha, "utf-8") < 1) {
            return $this->renderJSON([], "请输入符合要求的图像校验码~~", -1);
        }

        if (mb_strlen($captcha_code, "utf-8") < 1) {
            return $this->renderJSON([], "请输入符合要求的手机验证码~~", -1);
        }


        if (!SmsCaptcha::checkCaptcha($mobile, $captcha_code)) {
            return $this->renderJSON([], "请输入正确的手机验证码~~", -1);
        }

        $member_info = Member::find()->where(['mobile' => $mobile, 'status' => 1])->one();//member表里有该字段就直接登录跳转，没有就插入一条数据

        if (!$member_info) {
            if (Member::findOne(['mobile' => $mobile])) {